Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 13, 360, 640, 3)   246       
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 13, 180, 320, 3)   0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 11, 60, 106, 3)    246       
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 11, 30, 53, 3)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 9, 10, 17, 3)      246       
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 9, 5, 8, 3)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1080)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 20)                21620     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                210       
_________________________________________________________________
dense_3 (Dense)              (None, 6)                 66        
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 14        
=================================================================
Total params: 22,648
Trainable params: 22,648
Non-trainable params: 0
_________________________________________________________________
